/** Лектори факультету інформатики **/
lecturer(101, name("Іванов", "Іван", "Петрович"), birthdate(6,3,1970), "д.т.н", 602, 10000, "ІМ", 701, 501).
lecturer(102, name("Петров", "Петро", "Іванович"), birthdate(6,3,1961), "д.т.н", 602, 20000, "ІМ", 701, 501).
lecturer(103, name("Приходько", "Дмитро", "Петрович"), birthdate(6,3,1969), "к.т.н", 601, 13000, "КНУ", 701, 501).
lecturer(104, name("Шевченко", "Діана", "Іванівна"), birthdate(6,3,1979), "к.т.н", 601, 11000, "НАУ", 701, 501).
lecturer(105, name("Білик", "Олена", "Петрівна"), birthdate(6,3,1959), "", 603, 17000, "ЄУ", 701, 501).
lecturer(106, name("Соколов", "Дмитро", "Петрович"), birthdate(6,3,1969), "к.т.н", 601, 14000, "КНУ", 701, 502).
lecturer(107, name("Остапенко", "Світлана", "Василівна"), birthdate(6,3,1987), "", 604, 11000, "КПІ", 701, 503).

/** Лектори факультету економіки **/
lecturer(108, name("Соболева", "Софія", "Сергіївна"), birthdate(6,3,1990), "д.е.н", 602, 11000, "ІМ", 702, 504).
lecturer(109, name("Погребна", "Дарія", "Іванівна"), birthdate(6,3,1980), "", 603, 15000, "ІМ", 702, 504).
lecturer(110, name("Варещук", "Олег", "Степанович"), birthdate(6,3,1970), "к.е.н", 601, 14000, "КНУ", 702, 504).
lecturer(111, name("Степанова", "Аліна", "Іванівна"), birthdate(6,3,1965), "д.е.н", 602, 19000, "НАУ", 702, 505).
lecturer(112, name("Блінова", "Дарина", "Петрівна"), birthdate(6,3,1975), "", 604, 11000, "ЄУ", 702, 505).
lecturer(113, name("Любченко", "Данило", "Петрович"), birthdate(6,3,1977), "к.е.н", 601, 10000, "КНУ", 702, 505).
lecturer(114, name("Косих", "Петро", "Степанович"), birthdate(6,3,1965), "", 604, 17000, "КПІ", 702, 506).

/** Лектори факультету інозмених мов **/
lecturer(115, name("Водополов", "Максим", "Петрович"), birthdate(5,5,1980), "д.т.н", 602, 13000, "ІМ", 703, 507).
lecturer(116, name("Зорін", "Давид", "Іванович"), birthdate(13,2,1961), "д.т.н", 602, 20000, "ІМ", 703, 507).
lecturer(117, name("Науменко", "Павло", "Петрович"), birthdate(13,4,1969), "к.т.н", 601, 13000, "КНУ", 703, 507).
lecturer(118, name("Мостова", "Ірина", "Іванівна"), birthdate(9,1,1982), "", 604, 11000, "НАУ", 703, 507).
lecturer(119, name("Діденко", "Тетяна", "Петрівна"), birthdate(8,2,1980), "", 603, 13000, "ЄУ", 703, 508).
lecturer(120, name("Супрун", "Дмитро", "Петрович"), birthdate(2,8,1959), "к.т.н", 601, 12500, "КНУ", 703, 508).

/** Кафедри факультету інформатики **/
department(501, "Прикладної математики", 901).
department(502, "Комп'ютерних наук", 902).
department(503, "Програмної інженерії", 903).

/** Кафедри факультету економіки **/
department(504, "Фінансів і кредиту", 904).
department(505, "Обліку, аналізу і аудиту", 905).
department(506, "Міжнародної економіки", 906).

/** Кафедри факультету іноземних мов **/
department(507, "Англійської мови", 907).
department(508, "комунікативної лінгвістики", 908).

/** Посади **/
position(601, "Доцент").
position(602, "Професор").
position(603, "Старший викладач").
position(604, "Асистент").

/** Факультети **/
faculty(701, "Інформатики", 801).
faculty(702, "Економіки", 802).
faculty(703, "Іноземних мов", 803).

/** Предмети факультету інформатики **/
subject(201, "Лінійна алгебра", 120, "н", "б").
subject(202, "Java", 100, "н", "б").
subject(203, "Системне програмування", 150, "н", "м").
subject(204, "Теорія ймовірностей", 120, "н", "б").
subject(205, "Психологія", 90, "в", "б").

/** Предмети факультету економіки **/
subject(206, "Економетрика", 110, "н", "м").
subject(207, "Менеджмент", 140, "н", "б").
subject(208, "Економічна теорія", 150, "н", "б").

/** Предмети факультету іноземних мов **/
subject(209, "Англійська література", 120, "н", "б").
subject(210, "Іспанська мова", 90, "в", "б").


/** Розклад факультету інформатики **/
/** Пари викладача 101 **/
timetable(101, 201, 1, "пн", 1, 217).
timetable(101, 201, 2, "вт", 2, 213).
timetable(101, 202, 1, "ср", 1, 276).
timetable(101, 202, 2, "пн", 6, 237).
timetable(101, 202, 3, "пн", 2, 227).
timetable(101, 203, 1, "чт", 2, 407).
timetable(101, 203, 2, "вт", 1, 317).
timetable(101, 203, 3, "пт", 3, 210).
timetable(101, 204, 1, "ср", 5, 213).

/** Пари викладача 102 **/
timetable(102, 201, 5, "вт", 1, 511).
timetable(102, 201, 3, "ср", 2, 610).
timetable(102, 203, 1, "чт", 2, 407).
timetable(102, 203, 1, "сб", 7, 247).
timetable(102, 203, 3, "пт", 3, 210).
timetable(102, 204, 1, "ср", 5, 213).

/** Пари викладача 103 **/
timetable(103, 201, 1, "вт", 1, 51).
timetable(103, 201, 2, "ср", 3, 201).
timetable(103, 203, 1, "чт", 5, 407).
timetable(103, 203, 3, "пт", 7, 237).

/** Пари викладача 104 **/
timetable(104, 201, 1, "чт", 7, 123).
timetable(104, 203, 2, "вт", 2, 111).

/** Пари викладача 105 **/
timetable(105, 202, 1, "пт", 2, 121).
timetable(105, 204, 2, "чт", 6, 31).

/** Пари викладача 106 **/
timetable(106, 203, 1, "вт", 5, 45).
timetable(106, 201, 1, "ср", 3, 201).
timetable(106, 202, 1, "пт", 5, 201).

/** Пари викладача 107 **/
timetable(107, 202, 1, "вт", 2, 51).
timetable(107, 203, 2, "ср", 5, 201).


/** Розклад факультету економіки **/
/** Пари викладача 108 **/
timetable(108, 206, 1, "вт", 1, 132).
timetable(108, 207, 3, "пт", 5, 201).
timetable(108, 208, 2, "ср", 2, 231).

/** Пари викладача 109 **/
timetable(109, 206, 1, "пн", 1, 51).
timetable(109, 207, 1, "пн", 1, 201).
timetable(109, 208, 1, "пн", 1, 201).

/** Пари викладача 110 **/
timetable(110, 206, 2, "вт", 1, 133).
timetable(110, 208, 5, "ср", 1, 231).

/** Пари викладача 111 **/
timetable(111, 206, 2, "чт", 1, 51).
timetable(111, 207, 7, "вт", 1, 241).

/** Пари викладача 112 **/
timetable(112, 207, 2, "чт", 1, 331).

/** Пари викладача 113 **/
timetable(113, 206, 1, "ср", 5, 231).


/** Розклад факультету економіки **/
/** Пари викладача 115 **/
timetable(115, 209, 2, "вт", 1, 133).
timetable(115, 210, 5, "ср", 1, 231).

/** Пари викладача 116 **/
timetable(116, 210, 1, "пт", 1, 645).






/** ЗАПИТИ **/


/** Завдання 1. Варіант 2. Прізвища професорів і доцентів з місцем роботи на певній кафедрі? 
        Приклади: 
        z01_department_workers("Прикладної математики", X).          
        z01_department_workers("Фінансів і кредиту", X). **/
z01_department_workers(X, NAME):-
    department(DEP_KEY, X, _),
    lecturer(_, NAME, _, _, POS_KEY, _, _, _, DEP_KEY),
    position(POS_KEY, POS_NAME),
    (POS_NAME == "Доцент"; POS_NAME == "Професор").



/** Завдання 2. Варіант 7. Середній вік викладачів певної кафедри.
        Приклади: 
        z02_department_mean_age("Прикладної математики", YEARS).
        z02_department_mean_age("Фінансів і кредиту", X).  **/        
z02_department_mean_age(X, MEAN):-
        department(DEP_KEY, X, _),
        findall(YEAR, lecturer(_, _, birthdate(_, _, YEAR), _, _, _, _, _, DEP_KEY), YEARS),
        maplist(calc_age, YEARS, AGES), 
        list_mean(AGES, MEAN).

/** знайти вік за роком народження **/
calc_age(X, Y) :- Y is 2022 - X.

/** сума елементів в листі **/
list_sum([], M):- M=0.
list_sum([X|XS], M):- list_sum(XS, M1), M is X + M1.          

/** довжина листу **/
list_length([], M):- M=0.
list_length([_|XS], M):- list_length(XS, M1), M is M1+1.

/** середнє значення по листу **/
list_mean([X|XS], MEAN):- 
    list_sum([X|XS], S),
    list_length([X|XS], L),
    MEAN is S / L.




/** Завдання 3. Варіант 1. 
    1) Які викладачі читають ті самі предмети, що і певний викладач? 
            z03_same_subjects(name("Білик", "Олена", "Петрівна"), LECTS_KEYS) **/
z03_same_subjects(X, NAME):-
    lecturer(LECT_KEY, X, _, _, _, _, _, _, _),
    findall(SUBJ_KEY, timetable(LECT_KEY, SUBJ_KEY, _, _, _, _), SUBJECT_KEYS),
    lectures_by_subjects(SUBJECT_KEYS, LECTS),
    lecturer(LECTURE_KEY, NAME, _, _, _, _, _, _, _),
    member(LECTURE_KEY, LECTS),
    not(NAME == X).

/** лист всіх викладачів, що ведуть предмети з листу **/
lectures_by_subjects(KEYS, RES):-
    maplist(lect_key, KEYS, ALL),
    flatten(ALL, K),
    sort(K, RES).

/** лист всіх викладачів, що ведуть предмет **/    
lect_key(KEY, LECTS):-
    findall(LECTURE_KEY, timetable(LECTURE_KEY, KEY, _, _, _, _), LECTS).





    


        





